---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd.Dispose
source: html/ce6f7524-b372-0b16-b27c-6aa02ced4547.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd.Dispose Method

Releases all resources used by the FabricationPartRouteEnd

## Syntax (C#)
```csharp
public void Dispose()
```